app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find(params[:id])
    success = artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "testy"], ["updated_at", "2019-07-18 21:14:38.973222"], ["id", 1]]