app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jay"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    if params[:username]
      render json: User.find_by(username: params[:username])
    else
      render json: User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "camely"], ["updated_at", "2019-07-17 22:54:32.188733"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    success = user.update(user_params)